package jdk.statement;

/**
 * hi
 * 
 * @since 2016-11-19
 * @author fixalot
 */
public class JavadocTest {
	
	public static void main(String[] args) {
		// 자바 - 코드 스타일 - 포매터 설정에서 블럭 코멘트는 자동 포맷하지 않도록 설정해서 자바독 내용만 포맷됨.

		/*
		 * 블럭 코멘트. 날 포맷하지 마루요.블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날
		 * 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요.블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요.
		 */

		/**
		 * 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트.
		 * 날블럭 코멘트. 날 포맷하지 마루요. 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지
		 * 마루요. 블럭 코멘트. 날 포맷하지 마루요.블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭
		 * 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날블럭 코멘트. 날 포맷하지 마루요. 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날
		 * 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요.블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요.블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요.
		 * 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날블럭 코멘트. 날 포맷하지 마루요.
		 * 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요. 블럭 코멘트. 날 포맷하지 마루요.
		 * 블럭 코멘트. 날 포맷하지 마루요.
		 */

	}
}
